<template lang="pug">
.container
    h1.manual-popap__h2 Руководство по пользованию приложением
    ul
        li
            h3 Добавление слов
            div
                p 1. Впишите русское слово в левом окне, английское в правом.
                p 2. Нажмите кнопку добавить.
                p 3. Добавьте по очереди столько слов, сколько вам нужно выучить.
                p 4. Если такого слова нет, то оно добавится в словарь.
                p 5. Если такое слово есть, то приложение выдаст сообщение#{' '}
                    span "Такое слово уже есть в словаре".
                p 6. В левом поле появится слово для теста.
        li
            h3 Проверка слов
            div
                p 1. В левом поле появится слово по-русски.
                p
                    | 2. Впишите правильный ответ в правом поле и нажмите#{' '}
                    span "enter"#{' '}
                    | или кнопку#{' '}
                    span "Проверить"
                p
                    | 3. Если ответ верен, то приложение скажет#{' '}
                    span.good "Все верно!!!!!!!".
                p
                    | 4. Если ответ не верен то приложение выдаст#{' '}
                    span.red "Ответ не верен(((".#{' '}
                p 5. Программа не позволит продолжить пока не будет введен правильный ответ
                p 6. Слова для проверки выбираются в случайном порядке
                p
                    | 6. Если вы забыли слово нажмите кнопку#{' '}
                    span "Подсказка"
        li
            h3
                | Кнопка#{' '}
                span "Подсказка"
            div
                p 1. Подсказывает правильный ответ.
                p
                    | 2. В режиме проверки выученных слов#{' '}
                    span "Проверяю выученное"#{' '}
                    | переместит это слово из списка#{' '}
                    span "Знаю"#{' '}
                    | в список#{' '}
                    span "Учу"#{' '}
        li
            h3
                | Кнопка#{' '}
                span "Я уже знаю слово"
            div
                p
                    | 1. Переместит слово, которое отображено в левом окне из списка#{' '}
                    span "Учу"#{' '}
                    | в список#{' '}
                    span "Знаю"#{' '}
                    | .
                p 2. Выдаст следующее слово для проверки
                p
                    | 2. Посмотреть на список слов, которые находятся в категории#{' '}
                    span "Знаю"#{' '}
                    | и#{' '}
                    span "Учу"#{' '}
                    | можно нажав кнопку#{' '}
                    span "Показать словарь"
        li
            h3
                | Кнопка#{' '}
                span "Учу"
            div
                p 1. Отображает статус, в котором вы сейчас находитесь
                p
                    | 2. Статус#{' '}
                    span "Учу"#{' '}
                    | позволяет пользоваться словарем, добавлять слова в словарь.
                p
                    | 3. Статус#{' '}
                    span "Проверка выученного"#{' '}
                    | не пустит в словарь, не даст добавлять другие слова
                p
                    | 4. Статус#{' '}
                    span "Проверка выученного"#{' '}
                    | будут перебираться все слова в словаре отмеченные как#{' '}
                    span.good "Знаю"#{' '}
                    | . Перебор будет идти в случайном порядке, но программа будет помнить о тех словах, которые она выводила и не задаст их повторно.
                p
                    | 5. Статус#{' '}
                    span "Проверка выученного"#{' '}
                    | кнопка#{' '}
                    span "Отметить для повторения"#{' '}
                    | и кнопка#{' '}
                    span "подсказка"#{' '}
                    | работают одинаково ( т.е. переведут слова из списка#{' '}
                    span "Знаю"#{' '}
                    | в список#{' '}
                    span "Учу".
                p
                    | 6. После завершения повторения, приложение само переключится в режим#{' '}
                    span.good "Учу".
                p
                    | 7. Вы можете самостоятельно переключиться обратно в режим#{' '}
                    span.good "Учу"#{' '}
                    | нажав на кнопку#{' '}
                    span "Проверка выученного"
        li
            h3 Работа со словарем
            div
                p 1. В словаре можно изменять статус слова:
                p
                    | а.#{' '}
                    span "Учу"#{' '}
                    | : статус отвечает за то что слово будет выводиться во время#{' '}
                    span "Обучения"
                p
                    | б.#{' '}
                    span "Знаю"#{' '}
                    | : статус отвечает за то что слово будет выводиться во время#{' '}
                    span "Проверки знаний"
                p
                    | в.#{' '}
                    span "Знаю железно"#{' '}
                    | : статус отвечает за то что слово будет в словаре но не будет выводиться ни во время#{' '}
                    span "Обучения"#{' '}
                    | ни во время#{' '}
                    span "Проверки знаний"
                p
                    | 2. Вы в любой момент можете изменить статус слова просто щелкнув по полю с надписью#{' '}
                    span "Учу"#{' '}
                    | ,#{' '}
                    span "Знаю"#{' '}
                    | ,#{' '}
                    span "Знаю железно"#{' '}
                    | . Статусы меняются по кругу:#{' '}
                    span "Учу"#{' '}
                    | переходит в#{' '}
                    span.red "Знаю"
                    | ,#{' '}
                    span "Знаю"#{' '}
                    | переходит в#{' '}
                    span.red "Знаю железно"#{' '}
                    | ,#{' '}
                    span "Знаю железно"#{' '}
                    | возвращает статус#{' '}
                    span.red Учу"
                p
                    | 3. Также можно редактировать слова щелкнув по#{' '}
                    span "Редакт"#{' '}
                p
                    | 4. Удалять слова щелкнув по#{' '}
                    span "Х"
</template>

<style lang="stylus" scoped>
h1
    margin-bottom 2rem
ul
    list-style-type none
h3
    margin-bottom .8rem
li
    margin-bottom 1.4rem
span
    color orange
    &.red
        color red
    &.good
        color green
</style>
